// Ctrl+Z_Demo-VS.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"

# include <iostream>
# include <windows.h>

using namespace std;
//========================================
// Сложение пар чисел, вводимых до Ctrl+z
//=========================================
int _tmain(int argc, _TCHAR* argv[])
{
   SetConsoleOutputCP(1251);//Русификация вывода
 //  SetConsoleCP(1251);

   float a,b; //Пара чисел
   int count; //Счетчик количества пар чисел
   float Sum; //Переменная для накопления суммы
   int vers;
   cout <<  "\nВычисление суммы всех пар чисел,\
 введенных до нажатия Ctrl+z\n";
   cout <<  "\nУкажите вариант выполнения программы (от 1 до 5): ";
   cin >> vers;

 Sum = 0;  count =0; 
 switch (vers)
 {     //-------------------------------------------------
  case 1: // Можно так:
   while (1)// Потенциально "вечный" цикл
   {  cout << "\nВведите пару чисел или Crtl+z: ";
     cin >> a >> b; // ввод
     if ( cin.eof()) break; // Выход из цикла по Ctrl+z
	 cin.ignore(cin.rdbuf()->in_avail());
      cout << "\nВы ввели "<<a<<" "<<b<< ". Их сумма = "<< a+b<< endl;
	    count++;
     Sum += a + b;
   }
      break; //-------------------------------------------

  case 2: // Но МОЖНО И ТАК:
	  // Использована операция ",":
   while ( cout << "\nВведите пару  чисел или Crtl+z: ",
	   cin >> a >> b ) // cin вернет 0 (ЛОЖЬ) при любом сбое ввода !!!
   {  cout << "\nВы ввели "<<a<<" "<<b<< ". Их сумма = "<< a+b<< endl;
        count++;
     Sum += a + b;
   }
   break; //--------------------------------------------

  case 3: // А еще можно И ТАК:
	  // Использована операция ",":
   for( count =0; ; count++) 
   {  cout << "\nВведите пару  чисел или Crtl+z: ",
	   cin >> a >> b;
        if ( cin.eof()) break; // Выход из цикла по Ctrl+z
       cin.ignore(cin.rdbuf()->in_avail());
	   cout << "\nВы ввели "<<a<<" "<<b<< ". Их сумма = "<< a+b<< endl;
        
     Sum += a + b;
   }
      break; //--------------------------------------------

  case 4: // Но МОЖНО И ТАК:
	  // Использована операция ",":
   for( count =0; ( cout << "\nВведите пару  чисел или Crtl+z: ",
	   cin >> a >> b ); count++)   // cin вернет 0 (ЛОЖЬ) при любом сбое ввода !!!
   {  cout << "\nВы ввели "<<a<<" "<<b<< ". Их сумма = "<< a+b<< endl;
        
     Sum += a + b;
   }
      break; //--------------------------------------------
  case 5: // А как еще можно? ВАШ ВАРИАНТ:

      ;
 }//end switch
   cin.clear(); 
   cin.ignore(cin.rdbuf()->in_avail());
   cout << "\nВВОД ЗАВЕРШЕН." << endl <<
	   "Введено " << count << " пар чисел. Общая сумма = " << Sum <<endl;
   cin.get(); // Ожидается нажатие любой клавиши
	return 0;
}

